ПроизвольнаяНумерацияОбъектов/src/ExternalDataProcessors/ПроизвольнаяНумерацияОбъектов/ПроизвольнаяНумерацияОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExternalDataProcessor>
  <name>ПроизвольнаяНумерацияОбъектов</name>
  <attributes>
    <name>ОбъектМетаданных</name>
  </attributes>
  <attributes>
    <name>ЗапросСбораДанныхДляКода</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СимволРазделения_ПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеИзКатегории</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтруктураФормированияКодаРазработчику</name>
    <attributes>
      <name>ЭтоРеквизитОбъекта</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизитаОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СинонимРеквизитаОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКДанным</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьПрефикс</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеИзПрефикса</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СимволРазделения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтруктураРазмещениеПапок</name>
    <attributes>
      <name>ЭтоРеквизитОбъекта</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизитаОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СинонимРеквизитаОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКДанным</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьПрефикс</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеИзПрефикса</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СимволРазделения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтруктураХранениеФайлов</name>
    <attributes>
      <name>ЭтоРеквизитОбъекта</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизитаОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СинонимРеквизитаОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКДанным</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьПрефикс</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеИзПрефикса</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СимволРазделения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExternalDataProcessor>

ПроизвольнаяНумерацияОбъектов/src/ExternalDataProcessors/ПроизвольнаяНумерацияОбъектов/Forms/ФормаНастройкиНумерации/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.СимволРазделения_ПоУмолчанию) Тогда
		МЗ = РегистрыСведений.asur_ОбщиеНастройки.СоздатьМенеджерЗаписи();
		МЗ.Организация = Параметры.Источник.Организация;
		МЗ.Прочитать();
		СимволРазделения_ПоУмолчанию = МЗ.СимволРазделения_ПоУмолчанию;
	КонецЕсли; 
	
	Если Параметры.Свойство("Источник") Тогда
		Объект.ОбъектМетаданных = Параметры.Источник;
		КатегорияЗадачи = Параметры.Источник.КатегорияЗадачи;
	КонецЕсли; 
	
	ТипыДляПрефикса = Метаданные.РегистрыСведений.asur_ПрефиксыОбъектов.Измерения.Объект.Тип;
	
	ЗаполнитьСписокДоступныхРеквизитов();
	ЗаполнитьСтруктураФормированияКодаРазработчику();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СформироватьСтрокуКода(Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СтруктураФормированияКодаРазработчику

&НаКлиенте
Процедура СтруктураФормированияКодаРазработчикуЗначениеИзПрефиксаПриИзменении(Элемент)
	
	ТекДанные = Элементы.СтруктураФормированияКодаРазработчику.ТекущиеДанные; 
	//Если ТекДанные.ЗначениеИзПрефикса Тогда
	//	Значение = СписокРеквизитов.НайтиСтроки(Новый Структура("ИмяРеквизитаОбъекта", ТекДанные.ИмяРеквизитаОбъекта))[0].ЗначениеПрефикса;	
	//Иначе
	//	Значение = ПолучитьРеквизитЗадачи(Объект.ОбъектМетаданных, ТекДанные.ИмяРеквизитаОбъекта);	
	//КонецЕсли;
	
	ИмяКолонки = ?(ТекДанные.ЗначениеИзПрефикса, "ЗначениеПрефикса", "Значение" );
	НайденнаяСтрока = СписокРеквизитов.НайтиСтроки(Новый Структура("ИмяРеквизитаОбъекта", ТекДанные.ИмяРеквизитаОбъекта))[0];	
	ТекДанные.Значение = НайденнаяСтрока[ИмяКолонки];
	
	СформироватьСтрокуКода(Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРеквизитЗадачи(Задача, ИмяРеквизита)

	 ОбщегоНазначения.ЗначениеРеквизитаОбъекта( Задача, ИмяРеквизита)

КонецФункции // ()

&НаКлиенте
Процедура СтруктураФормированияКодаРазработчикуСимволРазделенияПриИзменении(Элемент)
	СформироватьСтрокуКода(Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
 
&НаКлиенте
Процедура СформироватьЗапросДляКода(Команда)
	ЗаполнитьЗапросИСтрокуДляКода();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗапросИСтрокуДляКода()
	Объект.ЗапросСбораДанныхДляКода = "";
	Объект.ЗапросСбораДанныхДляКода = СформироватьТекстЗапроса(Объект.СтруктураФормированияКодаРазработчику,"ЗначениеИзПрефикса")
	+
		 "
		|	;

		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	asur_КатегорииЗадачСтруктураФормированияКодаРазработчику.НомерСтроки КАК НомерСтроки,
		|	asur_КатегорииЗадачСтруктураФормированияКодаРазработчику.ИмяРеквизитаОбъекта КАК ИмяРеквизитаОбъекта,
		|	asur_КатегорииЗадачСтруктураФормированияКодаРазработчику.СинонимРеквизитаОбъекта КАК СинонимРеквизитаОбъекта,
		|	asur_КатегорииЗадачСтруктураФормированияКодаРазработчику.ЕстьПрефикс КАК ЕстьПрефикс,
		|	asur_КатегорииЗадачСтруктураФормированияКодаРазработчику.ЗначениеИзПрефикса КАК ЗначениеИзПрефикса,
		|	asur_КатегорииЗадачСтруктураФормированияКодаРазработчику.ПутьКДанным КАК ПутьКДанным,
		|	asur_КатегорииЗадачСтруктураФормированияКодаРазработчику.СимволРазделения КАК СимволРазделения
		|ИЗ
		|	ВТ_СписокЗадач КАК ВТ_СписокЗадач
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.asur_КатегорииЗадач.СтруктураФормированияКодаРазработчику КАК asur_КатегорииЗадачСтруктураФормированияКодаРазработчику
		|		ПО ВТ_СписокЗадач.КатегорияЗадачи = asur_КатегорииЗадачСтруктураФормированияКодаРазработчику.Ссылка

		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки ";
	
	Если Объект.ЗапросСбораДанныхДляКода = "" Тогда
		Возврат;
	КонецЕсли; 
	
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	ЗАпрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = Объект.ЗапросСбораДанныхДляКода;
	
	Запрос.УстановитьПараметр("Ссылка", Объект.ОбъектМетаданных);	
		Выборка = Запрос.Выполнить().Выбрать();
	
	ВДЗ = МВТ.Таблицы.Найти("ВТ_СписокЗадач").ПолучитьДанные().Выбрать();
	
	Пока Выборка.Следующий() Цикл
			
	КонецЦикла;
	МВТ.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьКатегорию(Команда)
	ЗаписатьКатегориюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСтрокуКода(Команда)
	СтрокаДляКода = "";
	Для каждого Стр Из  Объект.СтруктураФормированияКодаРазработчику Цикл
		//Стр.Значение = Объект.ОбъектМетаданных[Стр.ИмяРеквизитаОбъекта];
		Если Стр.ИмяРеквизитаОбъекта = "Код" Тогда
			Значение = Прав(Стр.Значение,3);
		ИначеЕсли Стр.ИмяРеквизитаОбъекта = "ДатаСозданияЗадачи" Тогда
			Значение = Формат(Стр.Значение, "ДФ=dd.MM.yyyy");
		Иначе
			Значение = Стр.Значение
		КонецЕсли; 
		
		СтрокаДляКода = СтрокаДляКода + Значение + Стр.СимволРазделения;
		
	КонецЦикла;                            
	//СобратьСтрокуКодаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьЕщеОбработку(Команда)
	ПараметрыФормы = Новый Структура("КатегорияЗадачи, ОбъектМетаданных", КатегорияЗадачи, Объект.ОбъектМетаданных); 
	
	//Вн_ИмяОбработки = "ПроизвольнаяНумерацияОбъектов2";
	Вн_ИмяОбработки = "ВнешняяОбработка1";
	
	Вн_ПутьКФайлу = "D:\1С Труд\! Разработка\kps_ASUR\ПроизвольнаяНумерацияОбъектов";
	Вн_ИмяФормы = ".Форма.Форма";
	
	asur_ИнтерфейсныеМеханизмы.ЗапуститьВнешнююОбработку(Вн_ИмяОбработки, Вн_ПутьКФайлу, Вн_ИмяФормы, ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСтруктураФормированияКодаРазработчику()
	Запрос = Новый Запрос;
	ЗАпрос.Текст = "ВЫБРАТЬ
	|	asur_КатегорииЗадачСтруктураФормированияКодаРазработчику.Ссылка КАК Ссылка,
	|	asur_КатегорииЗадачСтруктураФормированияКодаРазработчику.НомерСтроки КАК НомерСтроки,
	|	asur_КатегорииЗадачСтруктураФормированияКодаРазработчику.ЭтоРеквизитОбъекта КАК ЭтоРеквизитОбъекта,
	|	asur_КатегорииЗадачСтруктураФормированияКодаРазработчику.ЕстьПрефикс КАК ЕстьПрефикс,
	|	asur_КатегорииЗадачСтруктураФормированияКодаРазработчику.ЗначениеИзПрефикса КАК ЗначениеИзПрефикса,
	|	asur_КатегорииЗадачСтруктураФормированияКодаРазработчику.ИмяРеквизитаОбъекта КАК ИмяРеквизитаОбъекта,
	|	asur_КатегорииЗадачСтруктураФормированияКодаРазработчику.ПутьКДанным КАК ПутьКДанным,
	|	asur_КатегорииЗадачСтруктураФормированияКодаРазработчику.СимволРазделения КАК СимволРазделения,
	|	asur_КатегорииЗадачСтруктураФормированияКодаРазработчику.СинонимРеквизитаОбъекта КАК СинонимРеквизитаОбъекта,
	|	asur_КатегорииЗадачСтруктураФормированияКодаРазработчику.Значение КАК Значение
	|ИЗ
	|	Справочник.asur_КатегорииЗадач.СтруктураФормированияКодаРазработчику КАК asur_КатегорииЗадачСтруктураФормированияКодаРазработчику
	| ГДЕ  asur_КатегорииЗадачСтруктураФормированияКодаРазработчику.Ссылка = &КатегорияЗадачи";
	
	Запрос.УстановитьПараметр("КатегорияЗадачи", КатегорияЗадачи);
		
	Объект.СтруктураФормированияКодаРазработчику.Загрузить(Запрос.Выполнить().Выгрузить());
	

	//Заполнение значения из реквизитов
	Для каждого Стр Из Объект.СтруктураФормированияКодаРазработчику Цикл
		ИмяКолонки = ?(Стр.ЗначениеИзПрефикса, "ЗначениеПрефикса", "Значение");
		
		//Берем из Категории
		Если Объект.ЗначениеИзКатегории И ИмяКолонки = "ЗначениеПрефикса" Тогда
			Продолжить;
		КонецЕсли; 
		
		НайденнаяСтрока = СписокРеквизитов.НайтиСтроки(Новый Структура("ИмяРеквизитаОбъекта", Стр.ИмяРеквизитаОбъекта))[0];	
		Стр.Значение = НайденнаяСтрока[ИмяКолонки];
	КонецЦикла; 

	//СобратьСтрокуКодаНаСервере();
КонецПроцедуры
	
&НаСервере
Процедура ЗаполнитьСписокДоступныхРеквизитов()
	
	СписокРеквизитов.Очистить();
	
	//Стандартные Реквизиты
	Для каждого Реквизит Из Объект.ОбъектМетаданных.Метаданные().СтандартныеРеквизиты Цикл
		ИмяРеквизита = Реквизит.Имя;
		
		//Выводить Справочника: наименование , код 
		//Выводить Документа: Дата , Номер 
		//Если Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(Объект.ОбъектМетаданных)) Тогда
		Если Метаданные.Справочники.Содержит(Объект.ОбъектМетаданных.Метаданные()) Тогда
			Если ИмяРеквизита = "Код" ИЛИ ИмяРеквизита = "Наименование"  Тогда
				ДобавитьСтрокуСпискаРеквизитов(Реквизит);
			КонецЕсли
		//ИначеЕсли  Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Объект.ОбъектМетаданных))  Тогда
		ИначеЕсли  Метаданные.Документы.Содержит(Объект.ОбъектМетаданных.Метаданные())  Тогда
			Если ИмяРеквизита = "Дата" ИЛИ ИмяРеквизита = "Номер"  Тогда
				ДобавитьСтрокуСпискаРеквизитов(Реквизит);
			КонецЕсли
		КонецЕсли; 
		
	КонецЦикла; 
	
	//Добавленные реквизиты
	Для каждого Реквизит Из Объект.ОбъектМетаданных.Метаданные().Реквизиты Цикл
		ДобавитьСтрокуСпискаРеквизитов(Реквизит);
	КонецЦикла; 
	
	ЗаполнитьЗначенияСпискаРеквизитов(СписокРеквизитов);
	
	СписокРеквизитов.Сортировать("ИмяРеквизитаОбъекта");
	
	//СобратьСтрокуКода()

КонецПроцедуры

&НаСервере
Функция СформироватьТекстЗапроса(Знач ТаблицаФормы, ИмяРеквизитаПрефикса)
	
	ТекстЗапросаПрефикса = "";
	ТекстЗапросаСоединенияПрефикса = "";
	ТекстЗапроса =
		"ВЫБРАТЬ 
		| ТекОбъект.КатегорияЗадачи КАК КатегорияЗадачи, " + Символы.ПС;
	//КолСтрок = СписокРеквизитов.Количество(); 
	
	Для каждого Стр  Из ТаблицаФормы Цикл
		Если Стр.ИмяРеквизитаОбъекта = "КатегорияЗадачи" Тогда
		 	Продолжить;
		КонецЕсли; 
		
		ТекстЗапроса = ТекстЗапроса +
		" ТекОбъект." + Стр.ИмяРеквизитаОбъекта + " КАК " + Стр.ИмяРеквизитаОбъекта + "," + Символы.ПС;
		
		Если Стр[ИмяРеквизитаПрефикса] Тогда
			//_Префикс
			ИмяПоляТаблицы = Стр.ИмяРеквизитаОбъекта + "_Префикс";
			ТекстЗапросаПрефикса = ТекстЗапросаПрефикса + 
		"	ЕСТЬNULL(" + ИмяПоляТаблицы  + ".Префикс, """") КАК " + ИмяПоляТаблицы + "," + Символы.ПС;
			
			//СимволРазделения
			ИмяПоля = Стр.ИмяРеквизитаОбъекта + "_СимволРазделения";
			ТекстЗапросаПрефикса = ТекстЗапросаПрефикса + 
		"	ЕСТЬNULL(" + ИмяПоляТаблицы  + ".СимволРазделения, """") КАК " + ИмяПоля + "," + Символы.ПС;
			

			ТекстЗапросаСоединенияПрефикса = ТекстЗапросаСоединенияПрефикса + Символы.ПС +
		"		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.asur_ПрефиксыОбъектов КАК "+ ИмяПоляТаблицы + " 
			|  	ПО ТекОбъект." + Стр.ИмяРеквизитаОбъекта + " = " + ИмяПоляТаблицы + ".Объект" + Символы.ПС;

		КонецЕсли; 
				
	КонецЦикла; 
	
	ТекстЗапроса =  ТекстЗапроса + ТекстЗапросаПрефикса;
	
	//Убираю последнюю запятую	
	ТекстЗапроса =  Сред(ТекстЗапроса,1,СтрДлина(ТекстЗапроса)-2) + Символы.ПС;
	
	//Помещаю во Временную Талицу ВТ_СписокЗадач
	ТекстЗапроса = ТекстЗапроса +  " ПОМЕСТИТЬ  ВТ_СписокЗадач" + Символы.ПС; 
	
	ТекстЗапроса = ТекстЗапроса + 
		"ИЗ
		|	Справочник.asur_СписокЗадач КАК ТекОбъект " + Символы.ПС 
		+  ТекстЗапросаСоединенияПрефикса + Символы.ПС +  
		"ГДЕ
		|	ТекОбъект.Ссылка = &Ссылка";
	Возврат ТекстЗапроса;
	
КонецФункции
	
	
&НаСервере
Процедура ЗаполнитьЗначенияСпискаРеквизитов(ТаблицаФормы)
	
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	ЗАпрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = СформироватьТекстЗапроса(ТаблицаФормы, "ЕстьПрефикс");
	
	Запрос.УстановитьПараметр("Ссылка", Объект.ОбъектМетаданных);
	Запрос.Выполнить();
	
	
	ВДЗ = МВТ.Таблицы.Найти("ВТ_СписокЗадач").ПолучитьДанные().Выбрать();
	
	Если ВДЗ.Следующий() Тогда
		Для каждого Стр Из ТаблицаФормы Цикл
			Стр.Значение = ВДЗ[Стр.ИмяРеквизитаОбъекта];
			Если Стр.ЕстьПрефикс Тогда
				Стр.ЗначениеПрефикса = ВДЗ[Стр.ИмяРеквизитаОбъекта + "_Префикс"];
				Стр.СимволРазделения = ВДЗ[Стр.ИмяРеквизитаОбъекта + "_СимволРазделения"];
			Иначе
				Стр.СимволРазделения = Объект.СимволРазделения_ПоУмолчанию;
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	
	МВТ.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуСпискаРеквизитов(Реквизит)
	ИмяРеквизита = Реквизит.Имя;
	
	//не выводить реквизиты которые будут удалять
	Если СтрНайти(ИмяРеквизита,"Удалить") Тогда
		Возврат;
		//Не выводить уже выбранные реквизиты
//	ИначеЕсли 	ВыбранныеРеквизиты.НайтиСтроки(Новый Структура("ИмяРеквизитаОбъекта", ИмяРеквизита)).Количество() > 0 Тогда 
//		Возврат;
	КонецЕсли;
	
	Строка = СписокРеквизитов.Добавить();
	Строка.ИмяРеквизитаОбъекта     = ИмяРеквизита;
	Строка.СинонимРеквизитаОбъекта = Реквизит.Синоним;
	Строка.ЕстьПрефикс = ТипыДляПрефикса.СодержитТип(ТипЗнч(Объект.ОбъектМетаданных[ИмяРеквизита]));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокРеквизитовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элемент.ТекущиеДанные;
	СтрПоиска = Новый Структура("ИмяРеквизитаОбъекта", ТекДанные.ИмяРеквизитаОбъекта);
	
	Если НЕ Объект.СтруктураФормированияКодаРазработчику.НайтиСтроки(СтрПоиска).Количество() > 0 Тогда
		НовСтр = Объект.СтруктураФормированияКодаРазработчику.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ТекДанные);
		Если ТекДанные.ЕстьПрефикс Тогда
		   	НовСтр.ЗначениеИзПрефикса = Истина;
			НовСтр.Значение = ТекДанные.ЗначениеПрефикса;	
		КонецЕсли;
		НовСтр.ЭтоРеквизитОбъекта = Истина;
		
		СформироватьСтрокуКода(Истина);
		
		Возврат;
	КонецЕсли; 
	
	//СобратьСтрокуКодаНаСервере();

КонецПроцедуры

&НаСервере
Процедура СобратьСтрокуКодаНаСервере()
	СтрокаДляКода = "";
	Для каждого Стр Из  Объект.СтруктураФормированияКодаРазработчику Цикл
		//Если Стр.ЗначениеИзПрефикса Тогда
		//	ЗначениеСтроки = 
		//Иначе	
		//
		//КонецЕсли; 
		Стр.Значение = Объект.ОбъектМетаданных[Стр.ИмяРеквизитаОбъекта];
		
		СтрокаДляКода = СтрокаДляКода + Стр.Значение; 	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураФормированияКодаРазработчикуПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.СтруктураФормированияКодаРазработчику.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекДанные.ЕстьПрефикс Тогда
		Элементы.СтруктураФормированияКодаРазработчикуЗначениеИзПрефикса.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.СтруктураФормированияКодаРазработчикуЗначениеИзПрефикса.ТолькоПросмотр = Истина;			
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКатегориюНаСервере()
	КатегорияОбъект = КатегорияЗадачи.ПолучитьОбъект();
	
	КатегорияОбъект.СтруктураФормированияКодаРазработчику.Загрузить(Объект.СтруктураФормированияКодаРазработчику.Выгрузить());

	ЗаполнитьЗначенияСвойств(КатегорияОбъект, Объект, "СимволРазделения_ПоУмолчанию, ЗначениеИзКатегории"); 
	
	//ТЧ = КатегорияОбъект.СтруктураФормированияКодаРазработчику;
	//ТЧ.Очистить();
	//
	//Для каждого Стр Из  Объект.СтруктураФормированияКодаРазработчику Цикл
	//    НовСтрока = ТЧ.Добавить();
	//	ЗаполнитьЗначенияСвойств(НовСтрока, Стр); 
	//	 
	//	Если НЕ Стр.ЗначениеИзПрефикса ИЛИ Стр.ЭтоРеквизитОбъекта Тогда
	//	   Стр.Значение = "";
	//	КонецЕсли; 
	//
	//КонецЦикла; 
	
	КатегорияОбъект.Записать();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииБСП

#КонецОбласти
